In [1]:
import pandas as pd
import numpy as np

# Series

In [2]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [3]:
# create a series 
display(pd.Series(data = my_data))

display('-'*60)
display(pd.Series(data = my_data,index=labels))

display('-'*60)
display(pd.Series(arr,index=labels))

display('-'*60)
display(pd.Series(d))

0    10
1    20
2    30
dtype: int64

'------------------------------------------------------------'

a    10
b    20
c    30
dtype: int64

'------------------------------------------------------------'

a    10
b    20
c    30
dtype: int64

'------------------------------------------------------------'

a    10
b    20
c    30
dtype: int64

In [4]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Janpan'])
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Janpan'])
display(ser1,ser2)

USA        1
Germany    2
USSR       3
Janpan     4
dtype: int64

USA        1
Germany    2
Italy      5
Janpan     4
dtype: int64

In [5]:
ser1['USA']

1

In [6]:
ser1 + ser2

Germany    4.0
Italy      NaN
Janpan     8.0
USA        2.0
USSR       NaN
dtype: float64

# DataFrames Part1

In [7]:
from numpy.random import randn

In [8]:
np.random.seed(101)

In [9]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [10]:
# return a series
display(df['W'])
display(type(df['W']))

# return a list of columns
display(df[['W','Z']])

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

pandas.core.series.Series

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

In [11]:
df['new'] = df['W'] + df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [12]:
# axis 1 reference to columns
# if inplace is true and the result will maintain
df.drop('new',axis=1,inplace=True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [13]:
# axis 1 reference to rows/index
df.drop('E',axis=0)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [14]:
df.shape

(5, 4)

In [15]:
# grab the row A
display(df.loc['A'])

# grab the row C
display(df.iloc[2])

display(df.loc['B','Y'])

display(df.loc[['B','C'],['W','Y']])

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

-0.8480769834036315

          W         Y
B  0.651118 -0.848077
C -2.018168  0.528813

In [16]:
display(df > 0)

display(df[df>0])

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [17]:
# return the rows when W has to be true
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [18]:
# return X of the rows when W has to be true
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [19]:
# mutilp conditions
df[(df['W']>0) & (df['Y']<0)]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057

In [20]:
# the defulat of inplace is false 
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [21]:
newind = 'CA NY WY OR CO'.split(' ')

In [22]:
df['States'] = newind
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [23]:
display(df.set_index('States'))

# the defulat of inplace is false 
display(df)

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

# DataFrames Part2

In [24]:
# index levels
outside = ['G1','G1','G1','G2','G2','G2']
inside =[1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_idnex = pd.MultiIndex.from_tuples(hier_index)
hier_idnex

MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           codes=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [25]:
# create a mutilp level indexs
df = pd.DataFrame(randn(6,2),hier_idnex,['A','B'])
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

In [26]:
df.loc['G1']

          A         B
1  0.302665  1.693723
2 -1.706086 -1.159119
3 -0.134841  0.390528

In [27]:
df.index.names = ['Group','Numbers']
df

                      A         B
Group Numbers
G1    1        0.302665  1.693723
      2       -1.706086 -1.159119
      3       -0.134841  0.390528
G2    1        0.166905  0.184502
      2        0.807706  0.072960
      3        0.638787  0.329646

In [28]:
# return value when the numbers is one on both groups
df.xs(1,level='Numbers')

              A         B
Group
G1     0.302665  1.693723
G2     0.166905  0.184502

# Missing Data

In [36]:
d = {'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df = pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [37]:
# drop the row at least one NaN value
display(df.dropna())

# drop the columns at least one NaN value
display(df.dropna(axis=1))

     A    B  C
0  1.0  5.0  1

   C
0  1
1  2
2  3

In [38]:
display(df.dropna(thresh=2))

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [40]:
df.fillna(value='FILL')

      A     B  C
0     1     5  1
1     2  FILL  2
2  FILL  FILL  3

In [41]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# GroupBy